[
  {
    "title": "Hazelnut coffee cake",
    "description": "Perfect for afternoon tea, you won't be able to resist one, two or three slices of this hazelnut coffee cake.",
    "ingredients": "2 cups (200g) hazelnut meal\n1 cup (150g) self-raising flour\n1/2 tsp baking powder\n3 eggs, at room temperature\n 1 1/2 cups (330g) caster sugar\n3/4 cup (185ml) light olive oil\n1 cup (250ml) brewed Melitta Blue Mountain Style coffee\n 200g unsalted butter, softened\n2 1/4 cups (360g) icing sugar mixture\n2 tbsp brewed Melitta Blue Mountain Style coffee, extra\n200g dark chocolate, coarsely chopped\n60g unsalted butter, extra\n1 tbsp golden syrup",
    "instructions": "Step 1\nPreheat oven to 170°C. Grease a 20cm square pan. Line with baking paper. Combine the hazelnut meal, flour and baking powder in a medium bowl.\nStep 2\nUse an electric mixer to whisk eggs and 1 cup (220g) sugar in a large bowl for 10 mins or until light and fluffy and tripled in volume. Gradually add oil, beating on low speed to combine. Fold in hazelnut mixture. Stir in ¼ cup (60ml) of the coffee until combined. Pour into prepared pan. Bake for 50 mins or until a skewer inserted in centre comes out clean. Cool in the pan for 5 mins before transferring to a wire rack to cool.\nStep 3\nPlace remaining sugar and remaining coffee in a saucepan over medium heat. Stir for 3 mins or until sugar dissolves. Increase heat to high. Boil for 5 mins or until the coffee syrup thickens. Cool.\nStep 4\nUse an electric mixer to beat butter in a large bowl until very pale. Gradually add icing sugar, beating well after each addition. Beat in the extra coffee.\nStep 5\nPlace the chocolate, extra butter and golden syrup in a saucepan over low heat. Cook, stirring, until chocolate melts and mixture is smooth. Set aside to cool.\nStep 6\nCut cake horizontally into 3 layers. Place 1 cake layer on a serving plate. Brush with coffee syrup. Top with half the icing. Continue layering with remaining cake layers, syrup and icing. Spread with chocolate mixture. Cut into pieces.",
    "userId": 1
  },
  {
    "title": "Massaman beef pie with crushed potato topping",
    "description": "If you need an easy way to feed the crew, this massaman beef pie has all you need. Potatoes and chilli give it all the depth you need.",
    "ingredients": "2 tbsp peanut oil\n1kg diced beef\n1 brown onion, halved, cut into thick wedges\n2 large carrots, thickly sliced diagonally\n1 star anise\n1/2 cup massaman curry paste\n1 cup Massel beef stock\n400ml can coconut milk\n2 tbsp brown sugar\n2 tbsp fish sauce\n1 tbsp lime juice\n800g red delight potatoes, unpeeled\n 2/3 cup fresh coriander sprigs\n2 tbsp roasted unsalted peanuts, chopped\n1 long red chilli, thinly sliced\n1 tbsp fried shallots",
    "instructions": "Step 1\nHeat 1/2 the oil in a large frying pan over medium heat. Cook beef, in batches, for 5 minutes or until browned. Transfer to a heatproof bowl.\nStep 2\nAdd onion, carrot and star anise to pan. Cook, stirring, for 5 minutes or until onion softens. Add curry paste. Cook, stirring, for 1 minute. Return beef to pan with stock and coconut milk. Bring to a simmer. Reduce heat to low. Simmer, uncovered, for 1 hour or until beef is tender. Remove from heat. Discard star anise. Stir in sugar, fish sauce and lime juice. Cool for 10 minutes. \nStep 3\nMeanwhile, place potato in a large saucepan. Cover with cold water. Bring to the boil over high heat. Cook for 25 minutes or until tender. Drain. Return to pan over low heat. Cook, shaking pan occasionally, for 2 minutes or until potato is dry. Add remaining oil. Toss to combine. Roughly crush potato. Season with salt and pepper.\nStep 4\n Preheat oven to 220C/200C fan-forced. Transfer beef mixture to a 4cm-deep (8-cup-capacity) baking dish. Top with potato mixture. Bake for 20 minutes or until potato is browned and crisp. Stand for 10 minutes. Serve topped with coriander, peanuts, chilli and fried shallots.",
    "userId": 2
  },
  {
    "title": "Greek Turkey and Rice Skillet",
    "description": "Greek Turkey and Rice Skillet is an easy and flavorful ground turkey recipe that cooks in one skillet for maximum flavor and minimum effort.",
    "ingredients": "1 Tbsp olive oil\n2 cloves garlic\n19 oz ground turkey 97% lean\n1 tsp dried oregano\n1/4 tsp salt,pepper\n1 cup long grain white rice\n0.25 lb frozen cut leaf spinach\n1/3 cup sun dried tomato halves\n1/2 cup kalamata olives sliced\n1 and half cups chicken broth\nhandful fresh parsley\n1 fresh lemon \n1 oz feta",
    "instructions": "1. Add the olive oil and garlic to a large deep skillet and saute over medium heat for -2 minutes,or until the garlic is fragrant. Add the ground turkey,oregano,salt and pepper to the skillet.Continue to saute until the turkey is cooked through(about 5 minutes.\n 2. While the turkey is cooking, slice the olives and sun dried tomatoes. Once the turkey is cooked through, add te rice, frozen spinach( no need to thaw first), olives, and sun dried tomatoes to the skillet.\n 3. Add the chicken broth and stir until everything is very well combined.Place a lid on the skillet,turn the heat up to medium high, and allow it to come up to a boil,turn the heat down to low or medium low, and allow it to gently simmer for 15 minutes. Use the lowest level of heat that maintains a steady simmer in the skillet.\n 4. After 15 minutes,give the skillet a brief stir,replace the lid quickly,turn off the heat, an allow it to sit for an additional 10 minutes.\n 5. While the skillet is resting, zest half of the lemon and slice it into wedges. Roughly chop the parsley. Give the skillet a final fluff and stir,then top with lemon zest, parsley, and crumbled feta. Serve with lemon wedges to squeeze over top.",
    "userId": 3
  },
  {
    "title": "Beef and spinach pies",
    "description": "This delicious beef, spinach and pine nut pie makes simple dinners feel special.",
    "ingredients": "1 tbsp olive oil\n1 brown onion, chopped\n2 garlic cloves, crushed\n500g beef mince\n100g baby spinach\n2 tbsp pine nuts\n2 tbsp chopped fresh mint leaves\n1/4 cup lemon juice\n6 sheets ready-rolled puff pastry, partially thawed\n100g feta, crumbled\n1 egg, lightly beaten\n2 tsp poppy seeds\nLemon wedges, to serve",
    "instructions": "Step 1\nHeat oil in a frying pan over high heat. Add onion and garlic. Cook, stirring for 3 minutes or until onion is soft. Add mince. Cook, stirring with a wooden spoon to break up mince, for 8 minutes or until browned.\nStep 2\nAdd spinach and pine nuts. Cook, stirring for 2 minutes or until wilted. Add mint and lemon juice. Season with salt and pepper. Stir to combine then cool. Preheat oven to 200°C/180°C fan-forced. Grease and line 2 large baking trays. Using an 11.5cm cutter, cut 24 rounds from pastry sheets. Spoon 2 tablespoons of mince mixture into centre of 1 pastry round. Top with 2 teaspoons of feta. Brush edge with egg. Top with 1 pastry round. Press edges of pastry together, brush with egg. Sprinkle with poppy seeds. Place on tray and repeat.\nStep 3\nBake for 20 minutes or until pastry is golden and puffed. Serve with lemon wedges.",
    "userId": 2
  },

  {
    "title": "Tofu and mushroom ramen",
    "description": "Ready in 20 minutes - this delicious tofu and mushroom ramen is healthy, quick and satisfying!",
    "ingredients": "4 Coles Australian Free Range Eggs\n1 tbsp vegetable oil\n300g firm tofu, thinly sliced\n8 cups (2L) Coles Japanese Inspired Mushroom & Miso Style Broth\n270g ramen noodles\n100g fresh shiitake mushrooms, sliced\n400g pkt frozen edamame, thawed, peeled\n1/2 sheet nori, finely shredded\n1 tsp sesame seeds, toasted",
    "instructions": "Step 1\nCook the eggs in a saucepan of boiling water for 7 mins for soft-boiled or until cooked to your liking. Refresh under cold water.\nStep 2\n\nMeanwhile, heat the oil in a medium frying pan over medium heat. Cook the tofu, in 2 batches, for 2 mins each side or until golden.\nStep 3\nPlace the stock in a large saucepan. Bring to the boil over high heat. Reduce heat to medium. Add the noodles and mushroom to the pan. Cook, stirring occasionally, for 3 mins or until the noodles are tender. Add the edamame. Cook for 1 min or until heated through.\nStep 4\nPeel each egg and cut in half. Divide the noodle mixture evenly among serving bowls. Top with tofu, egg and nori. Sprinkle with the sesame seeds.",
    "userId": 1
  },
  {
    "title": "Roasted tomato panzanella salad",
    "description": "With roasted tomatoes, bocconcini and torn ciabatta bread, this gorgeous panzanella salad makes for the perfect side.",
    "ingredients": "750g mixed grape tomatoes\n125ml (1/2 cup) extra virgin olive oil\n2 tbsp caramelised balsamic vinegar\n1/2 bunch fresh oregano, leaves picked\n1 tbsp chopped fresh thyme\n4 garlic cloves, unpeeled\n250g ciabatta, torn into pieces\n100g (1 cup) coarsely grated mozzarella\n25g (1/4 cup) grated parmesan\n1/2 lemon, juiced\n110g tub buffalo mozzarella, drained, torn\n220g tub bocconcini, drained\n100g kalamata olives\n 1/2 bunch fresh basil, leaves picked",
    "instructions": "Step 1\nPreheat oven to 200C/180C fan forced. Line 2 baking trays with baking paper. Place the tomatoes on a prepared tray and drizzle with 2 tbs oil and 1 tbs balsamic. Sprinkle with half the oregano and 2 tsp thyme leaves. Season. Place the garlic on a piece of foil and drizzle with 1 tbs oil. Wrap to enclose and add to the tray with the tomatoes. Place the tray on the bottom shelf of the oven. Roast for 20-25 minutes or until the tomatoes are slightly blistered and the garlic is tender.\nStep 2\nMeanwhile, place bread and remaining 2 tbs oil and 2 tsp thyme in a bowl. Toss to combine. Season. Place bread on remaining prepared tray. Place on the top shelf of the oven. Bake for 5 minutes or until slightly golden. Sprinkle the grated mozzarella and parmesan over the bread. Bake for a further 10 minutes or until the cheese is melted.\nStep 3\nRemove trays from oven. Set aside to cool slightly. Unwrap garlic. Squeeze the garlic flesh into a bowl. Lightly mash with a fork.\nStep 4\nPour the juices from the tomato tray into the bowl with the garlic. Add the lemon juice and remaining 1 tbs balsamic and 25ml olive oil. Arrange the tomatoes, bread, mozzarella, bocconcini, olives, basil and remaining oregano on a serving platter. Drizzle with dressing. Season.",
    "userId": 3
  },
  {
    "title": "Squid ink pasta with calamari",
    "description": "Squid ink pasta adds a gourmet touch to this vibrant calamari pasta.",
    "ingredients": "400g squid ink pasta (see note\n2 tbsp olive oil, plus extra to drizzle\n 500g cleaned squid tubes, sliced into 1cm rings\n2 eschalots, thinly sliced\n3 garlic cloves, finely chopped\n1/4 cup (60ml) white wine\n1/2 cup (125ml) Mutti Tomato Passata\n500g vine-ripened cherry tomatoes\nBasil leaves, to serve\nLemon wedges, to serve",
    "instructions": "Step 1\nCook the pasta in a saucepan of boiling salted water according to the packet instructions. Drain, reserving 1/4 cup (60ml) cooking water. Toss pasta with a little oil to loosen.\nStep 2\nHeat 1 tbs oil in a large frypan over medium-high heat. Season the squid rings, then cook for 2 minutes or until light golden. Remove from pan.\nStep 3\nReturn pan to medium heat and add remaining 1 tbs oil. Add the eschalot and cook, stirring, for 2 minutes or until softened. Add garlic and cook for 1 minute or until fragrant, then add wine and cook for a further 1 minute or until slightly reduced.\nStep 4\nAdd passata and cherry tomatoes, then cook for 5 minutes or until tomatoes start to collapse. Season, then return calamari to the pan with the reserved water and cook for 2-3 minutes or until warmed through.\nStep 5\nDivide pasta and sauce among bowls, and serve with basil and lemon wedges.",
    "userId": 3
  },
  {
    "title": "One-pot sausage stew",
    "description": "Ready and on the table in 45 minutes, this tasty meal is a midweek winner!",
    "ingredients": "1 tbsp olive oil\n500g extra-lean beef chipolata sausages\n1 medium brown onion, halved, sliced\n2 garlic cloves, crushed\n400g can Coles Cannellini Beans, drained, rinsed\n800g can Coles Italian Diced Tomatoes\n1/4 cup barbecue sauce\n1 tbsp brown sugar\nChopped fresh flat-leaf parsley leaves, to serve\nCrusty bread, to serve",
    "instructions": "Step 1\nHeat half the oil in a large, heavy-based saucepan over medium-high heat. Cook sausages, in batches, turning, for 5 to 6 minutes or until browned all over. Transfer to a plate.\nStep 2\nHeat remaining oil in pan. Add onion and garlic. Cook, stirring, for 5 to 6 minutes or until onion has softened. Add beans, tomato, barbecue sauce and sugar. Return sausages to pan. Cover. Bring to the boil. Reduce heat to medium-low. Simmer, uncovered, for 25 minutes or until sausages are cooked through and sauce thickened. Sprinkle with parsley. Serve with bread.",
    "userId": 2
  },
  {
    "title": "One-pan teriyaki beef and rice",
    "description": "This easy beef mince dinner is ready in just 20 minutes and it only uses a few ingredients - plus, it's a measly $3.55 per serve.",
    "ingredients": "4 green shallots\n1 tbsp vegetable oil\n500g Coles Beef 3 Star Mince\n125ml (1/2 cup) teriyaki marinade\n2 tsp cornflour\n500g packet frozen stir-fry vegetable mix\n450g packet microwave long-grain rice",
    "instructions": "Step 1\nFinely chop 2 shallots and slice the remaining into long thin strips. Place the long thin strips in a bowl of iced water to curl until needed.\nStep 2\nHeat the oil in a large deep frying pan or wok over high heat. Add the beef. Cook, using a wooden spoon to break up any lumps, for 5 minutes. Combine the teriyaki marinade and cornflour in a small bowl until smooth. Add to the beef and stir to combine. Add the vegetables. Cover and cook, stirring occasionally, for 5 minutes or until the vegetables are heated through.\nStep 3\nWarm the rice following packet directions. Add the chopped shallot and toss to combine. Drain the curled shallot. Divide the rice mixture among serving bowls and spoon over the teriyaki beef. Top with the shallot curls to serve.",
    "userId": 1
  },
  {
    "title": "Chilli naan breads with chicken",
    "description": "This easy dinner idea made with chicken and tandoori paste is ready in only 30 minutes, but we bet you'll eat it in less than five minutes!",
    "ingredients": "500g Coles RSPCA Approved Australian Chicken Breast Mince\n1/4 cup (75g) tandoori paste\n1 cup (280g) Greek-style yoghurt\n1/2 cup finely chopped mint\n1 tbsp finely chopped dill\n40g butter, melted\n1 long red chilli, finely chopped\n4 naan breads\n2 carrots, peeled, cut into long matchsticks\n2 Lebanese cucumbers, cut into long matchsticks\n1 red onion, thinly sliced\n1 long red chilli, extra, thinly sliced\nMango chutney, to serve",
    "instructions": "Step 1\nHeat a large non-stick frying pan over high heat. Cook the mince, stirring with a wooden spoon to break up any lumps, for 5 mins or until the mince changes colour. Add tandoori paste. Cook, stirring, for 5 mins or until mince is cooked through. Cover to keep warm.\nStep 2\nCombine the yoghurt, mint and dill in a small bowl. Season.\nStep 3\nMeanwhile, heat a chargrill on high. Combine the butter and chilli in a bowl. Brush butter mixture over the top of 1 naan bread. Cook on grill for 1 min each side or until lightly charred. Repeat, in batches, with the remaining butter mixture and naan breads.\nStep 4\nPlace the naan breads on serving plates. Top with the yoghurt mixture, chicken mixture, carrot, cucumber, onion, extra chilli and chutney.",
    "userId": 1
  }
]
